senolgulgonul/TangSketch/bsp/hardware/tangsketch/avr/boards.txt
##############################################################
# TangSketch — Tang Nano 9K (PicoRV32 RISC-V)
# https://github.com/senolgulgonul/TangSketch
##############################################################

tangnano9k.name=Tang Nano 9K (PicoRV32 / picotiny)

tangnano9k.upload.tool=pico_programmer
tangnano9k.upload.protocol=uart
tangnano9k.upload.maximum_size=7340032
tangnano9k.upload.speed=115200
tangnano9k.upload.wait_for_upload_port=false

tangnano9k.build.mcu=rv32i
tangnano9k.build.f_cpu=25175000L
tangnano9k.build.board=TANGNANO9K
tangnano9k.build.core=picotiny
tangnano9k.build.variant=tangnano9k
tangnano9k.build.extra_flags=
